import React from 'react';

import css from './Button.module.css'

// робим кастомну кнопку; Children викор. для кастомізації компонентів або коли нам треба обгорнути нашу компоненту якимось компонентами

const Button = ({children, click, ...props}) => {
    // в кожної проперті є ключ children, також на вхід передаєм пропсу click і в div кажем що там буде
    //Event onclick, який буде запускати ф-ію click і тепер при виклику нашого Button в AboutPage в нас є пропертя click в яку ми можем передати coolback ф-ію;
    // на вхід в якості проперті можна ще щось передати і якщо ми хочем деструризувати обєкт і витягнути з нього декілька значень а всі інші щоб записались в окремий обєкт
    //ми просто деструктуризуєм цей обєкт і називаєм наприклад props (залишені пропси);І тепер в div можна передати обєкт властивостей ш деструктуризувати там props
    // (як приклад це ф-ія register в useForm). Тепер в компоненту Button можна передати ще щось інше, наприклад якийсь стиль для швидкої заміни або будь-які речі які може приймати div/
    return (
        <div className={css.Button} onClick={click} {...props}>
            {children}
        </div>
    );
};

export {Button};
